{
    "l0": {
        "title": "Урок 0",
        "text": "където ще се запознаем",
        "p1p": "Здравей!",
        "p2p": "Аз съм автора на Интентум. И моята цел е до края на този „курс“ да имаш всички нужни знания в информатиката и програмирането, за да можеш да продължиш да учиш и без мен. И да правиш без мен. „Курсът“ е разделен на 42 урока (без урок 0) и 8 теста. Това би трябвало да обхваща всичко нужно за един старт в програмирането и да покрива целия материал по информатика от 8-ми до 12-ти клас, без да отнема 5 години. Всеки урок има тематично заглавие, което показва какво ще правиш в него.",
        "p3p": "Уроците не са сложни и са максимално опростени – вярвам че всеки може да се научи да програмира, ако обяснението е лесно. Това и причината да създам този източник – аз самия започнах от една книга за програмирането на английски, от която почти нищо не разбрах за програмирането. А на български източници почти няма. Един ден, някой ме попита „Ти как се научи?“, аз започнах да се оплаквам, че няма какво да му препоръчам, и изведнъж ми хрумна сам да се занимая с тази задача. И ето ме тук",
        "p4p": "Уроците до които не си стигнал са заключени. За да отключиш урок, трябва да минеш предния, или да натиснеш ключалката, която се намира на мястото на старт бутона. Аз обаче не препоръчвам да се пропускат уроци. Идеята на отключването е да можеш да си на едно ниво и на компютър, и на телефон, без да се налагат профили (и съответно, връзка с интернет) – не да пропускаш важен материал.",
        "p5p": "Уроците си имат и секции, като на края на всяка секция има въпрос и ключалка, криеща по-долния материал. Този въпрос е за самопроверка – независимо как отговориш, долния материал ще се разкрие. Твоя е задачата да прецениш дали не ти трябва още един прочит!",
        "p6p": "Казах че има и 8 теста. Не се плаши! Независимо какво направиш на тест, продължаваш на следващия урок. Тестовете са за самопроверка – до установиш собственото си ниво и да прецениш дали трябва да продължиш със следващия урок или да се върнеш назад.",
        "p7p": "Както забелязваш, особено важна ще е самопроверката. Колкото ти разчиташ на мен да има лесни и добре написани уроци, толкова и аз разчитам на теб сам да осъзнаваш кога трябва да наблегнеш на нещо. Желание се изисква и от двете страни.",
        "p8p": "В момента може да си представяш програмирането като някаква древна магия, използваема единствено от наследниците на Айнщайн и тези които решават кубични уравнения на салфетки, пишейки с кал, докато изкачват Мусала. Това не е така, и дори не се изисква да си особено добър математик. Предполагам обаче, че мога да ти докажа това само по един начин.",
        "p9p": "Засега това е от мен. Ще се срещнем отново в следващия урок – първия истински. Пожелавам ти късмет!"
    },
    "l1": {
        "title": "Урок 1",
        "text": "където ще научиш, че цифрите не са само 10",
        "p1p": "Вече сме в първия урок! Добре дошъл/дошла!",
        "p2p": "Предполагам, че заглавието на урока те е изненадало, и в момента се чудиш „Как така да не са 10 цифрите? Учителят от началното училище не спря да ми го повтаря“. Е, за да ти отговоря, първо трябва да те върна във въпросното начално училище.",
        "p3p": "Тогава си учил/а числата. И когато си ги учил, са те карали да пишеш нещо подобно:",
        "p4p": "56 = 5*10 + 6",
        "p5p": "Има логика. Да пробваме с трицифрено число:",
        "p6p": "156 = 1*100 + 5*10 + 6",
        "p7p": "Нека да запишем това в пълния му вариант – в крайна сметка, 6 всъщност се умножава по 1:",
        "p8p": "156 = 1*100 + 5*10 + 6*1",
        "p9p": "Първо да видим какво е общото между числата 100 и 10. От тук чувам как мислиш „И двете се делят на 10“. И си прав. Не само това, но и двете са степени на 10 –> 10 е 101 , а 100 е 102 . Да го запишем („^“ е знак за степен):",
        "p10p": "156 = 1 * 10^2 + 5 * 10^1 + 6*1",
        "p11p": "Аз обаче мога да ти кажа, че всъщност между всички три множителя има връзка – 100, 10 и 1. И трите всъщност са степени на 10. И в момента, може да се сетиш за нещо, което ти е било казано преди дълго време – което и да е число, повдигнато на степен 0, е 1. Тоест, 100 е 1. Сега получаваме:",
        "p12p": "156 = 1 * 10^2 + 5 * 10^1+ 6*10^0",
        "p13p": "Добре, значи да пробваме със шестцифрено число:",
        "p14p": "907 156 = 9 * 10^5+ 0 * 10^4 + 7 * 10^3 + 1 * 10^2 + 5 * 10^1 + 6*10^1",
        "p15p": "Можем да продължим още, но с всяко число ще получим нещо подобно. Изводът е, че всяко число в десетичната бройна система е равно на сбора от всичките му цифри, където всяка цифра се умножава по десет на степен позицията и. Тоест, каквото написахме горе, но в думи. Позицията на цифра се определя отдясно наляво – най-дясната цифра е 0,  всяка следваща е с 1 по-голяма. Например:",
        "p16p": "1 907 156 - Цифра",
        "p17p": "6 543 210 - Позиция",
        "p18p": "Поради факта че цифрите тук са 10 (0, 1, 2, 3, 4, 5, 6, 7, 8, 9) и умножаваме по степен на 10, казваме че имаме десетична бройна система. А базата е 10.",
        "p19tq": "Каква би била базата на система с 2 цифри?",
        "p20fq": "Запиши на какво е равно числото 796 спрямо образеца 156 = 1 * 10^2 + 5 * 10^1 + 6*10^0, където „^“ значи степен.",
        "p21p": "След като изяснихме това, да напуснем началното училище и да се върнем в настоящето. И тук идва истинската цел на урока: да разбереш двоичната бройна система.",
        "p22p": "На всички им е известно, че компютрите разбират само 0 и 1. Съответно, те използват бройна система, където има само две цифри – 0 и 1. Една нула или единица е бит. И базата на тази система е 2.",
        "p23p": "Само с тази информация можем да дешифрираме нулите и единици. Например, имаме числото 010. Позициите са както следва:",
        "p24p": "210",
        "p25p": "Знаем, че ни трябва сбор от цифрите умножени по базата на степен позицията. Базата е 2, а позициите ги имаме:",
        "p26p": "010 = 0 * 2^2 + 1 * 2^1 + 0 * 2^0 = 0 * 4 + 1 * 2 + 0 * 1 = 2",
        "p27p": "Това е. Току що превърнахме числото 010 (база 2) в число в база 10 – 2. Да пробваме с нещо по-сложно – 1 байт – тоест 8 бита или с други думи, 8 цифри:",
        "p28p": "10110110 = 1 * 2^7 + 0 * 2^6 + 1 * 2^5 + 1 * 2^4 + 0 * 2^3 + 1 * 2^2 + 1 * 2^1 + 0 * 2^0 =  1 * 128 + 0 * 64 + 1 * 32 + 1 * 16 + 0 * 8 + 1 * 4 + 1 * 2 + 0 * 1 = 128 + 32 + 16 + 4 + 2 = 182",
        "p29p": "И ето че превърнахме в десетична бройна система и това дълго число.",
        "p30fq": "Превърни 11101110 в десетична бройна система",
        "p31tq": "110 в двоична бройна система е равно на колко в десетична?",
        "p32p": "Да направим обратното и да вземем отново числото 156. Този път, няма да умножаваме по 10, а ще делим на 10. С остатък. Получаваме: ",
        "p33p": "156 / 10 = 15  (15 * 10 = 150 -> остатък 6)",
        "p34p": "15 / 10 = 1 (1*10 = 10 -> остатък 5)",
        "p35p": "1 / 10 = 0 (0*10 = 0 -> остатък 1)",
        "p36p": "Забелязваме нещо. Ако вземем остатъците отдясно наляво, получаваме началното число: 156. За да направим това делим на базата 10, и получаваме число в десетична бройна система. Тогава да пробваме да делим на база 2, и може би ще получим число в двоична бройна система:",
        "p37p": "156 / 2 = 78 (остатък 0)",
        "p38p": "78  / 2 = 39 (остатък 0)",
        "p39p": "39 / 2 = 19 (ост. 1)",
        "p40p": "19 / 2 = 9 (ост. 1)",
        "p41p": "9 / 2 = 4 (ост. 1)",
        "p42p": "4 / 2 = 2 (ост. 0)",
        "p43p": "2 / 2 = 1 (ост. 0)",
        "p44p": "1 / 2 = 0 (ост. 1)",
        "p45p": "Значи, следвайки горната логика, получаваме числото 10011100, което изглежда в двоична бройна система (не забравяй, че четем отдясно наляво). Да направим проверка:",
        "p46p": "10011100 = 1 * 2^7 + 0 * 2^6 + 0 * 2^5 + 1 * 2^4 + 1 * 2^3 + 1 * 2^2 + 0 * 2^1 + 0 * 2^0 = 1 * 128 + 0 * 64 + 0 * 32 + 1 * 16 + 1 * 8 + 1 * 4 + 0 * 1 = 128 + 16 + 8 + 4 = 156",
        "p47p": "Значи сме работили правилно!",
        "p48p": "И това е цялата двоичната бройна система. Нито е прекалено сложна, нито нещо неразбираемо. Надявам се да си хванал. Въпреки това, се тествай:",
        "p49fq": "Въпрос: На колко е равно 238 в двоична бройна система?",
        "p50p": "Свърших с материала за урока, но още не съм обяснил откъде идва заглавието. Всъщност е просто. По същия начин, по който можем да имаме бройни системи с бази по-малки от 10, можем да имаме и такива с по-големи от 10. Една широко използвана с по-голяма база е шестнадесетичната бройна система – с 16 цифри, тоест база 16. „Как така?“ питаш ти, и отговора е, че цифрите са тези  - 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, A (10), B (11), C (12), D (13), E (14), F (15). Използват се букви за по-големите от 9. Главно се ползва за цветове. Например, числото EFEFEF е цвета на фона в по-голямата част на приложението. В десетична система това е 15 724 527, и виждаш че EFEFEF е сравнително по-лесно за изписване – има практическа полза.",
        "p51rq": "Въпрос за търсене – избери си цвят и потърси числото му в база 16 в Интернет, като имаш предвид, че тези записи на цветове много често се наричат и hex, или хексове."
    },
    "l2": {
        "title": "Урок 2",
        "text": "където ще научиш как се събират и изваждат числа… отново",
        "p1p": "В този урок ще се научиш да събираш и изваждаш с други бройни системи. Подобно на цялата тема за други бройни системи, и това не е сложно.",
        "p2h": "Събиране",
        "p3p": "Нека първо да съберем две числа в десетичната бройна система. Нека да са 96 и 56.",
        "p4pre": "\n 96 \n + \n 56 \n152",
        "p5p": "Правил/а си това много пъти – слагаш двете числа едно под друго. Събираш първата колона отдясно наляво. Ако сборът е по-малък от 10, го записваш долу. Ако е по-голям или равен на 10, например 12, слагаш едно на ум на следващата колонка и записваш последната цифра – 2  (или записано по друг начин, разликата на 12 и 10). Това се повтаря с всички колонки.",
        "p6p": "Събирането на числа в двоичната бройна система всъщност е същото. Само че вместо да следим за 10, следим за 2 – базата на системата. Тоест, ако сборът на колонка е по-малък от 2, го записваме, иначе слагаме едно на ум на следващата колонка и записваме разликата на сбора и 2. Нека да пробваме:",
        "p7pre": "\n 101 \n + \n 011 \n1000",
        "p8p": "Първо събираме 1 и 1. Получава се 2, което е равно на две. Следователно пишем 1 на ум над следващата колонка и записваме 2-2 = 0. На следващата колонка събираме 0 и 1 и получаваме 1, но имаме 1 на ум, следователно сборът е 2. Слагаме 1 на ум, записваме 0 и продължаваме. На следващата колонка събираме 1 и 0, получаваме 1. Имаме 1 на ум, събираме и него, и получаваме 2. Пишем 1 на ум на следващата колонка. Записваме 0. Последната колонка е празна, затова пишем просто 1 (от предното 1 на ум). Получаваме 1000. Нека да направим проверка. 101 е 5. 011 е 3. 1000 е 8. Значи сме работили правилно.",
        "p10fq": "Колко е 10101101 + 01100110?",
        "p11h": "Изваждане",
        "p12pre": "\n101\n-\n011\n010",
        "p13p": "Тук, първо изваждаме 1 от 1. Получаваме 0, и я записваме долу. След това се опитваме да извадим 1 от 0.  Но не можем, защото 0 е по-малко от 1. Значи, взимаме 1 на ум от следващата колонка. Получаваме 2-1, което вече е 1. Записваме 1 долу. След това, трябва да извадим 1-0. Обаче сме взели 1 на ум, тоест ни остава 0-0. Записваме 0 долу. И имаме резултат. Да направим проверка: 101 е 5. 011 е 3. 010 е 2. Значи сме работили правилно.",
        "p14fq": "Запиши резултата на 10011 – 101",
        "p15h": "Умножение",
        "p16p": "Умножението на двоични числа е абсолютно същото като на десетични. Разлика няма. Важно е да не забравяш че събираш двоични числа, не десетични.",
        "p17pre": "\n  1101*11 \n  1101\n 1101\n100111",
        "p18fq": "Запиши резултата на 101 * 011",
        "p19h": "Деление",
        "p20p": "Делението на числа в други бройни системи е сравнително по-трудоемко. Най-лесния начин е да превърнеш числата в десетична бройна система, да ги разделиш, и резултата да превърнеш в двоично число. Например:",
        "p21pre": "\n110 / 011\n110 = 1 * 4 + 1*2 + 0*1 = 6\n011 = 0*4 + 1*2 + 0*1 = 3",
        "p22p": "Вече виждаме, че 6/3 = 2. Превръщаме 2 в двоична бройна система и получаваме 010. Следователно:",
        "p23pre": "110 / 011 = 010"
    },
    "l3": {
        "title": "Урок 3",
        "text": "където ще научиш как текст става нули и единици"
    },
    "l4": {
        "title": "Урок 4",
        "text": "където ще научиш, че разширенията са лъжа"
    },
    "l5": {
        "title": "Урок 5",
        "text": "където ще научиш как са управлявали компютрите преди графиката"
    },
    "l6": {
        "title": "Урок 6",
        "text": "където ще научиш какво е алгоритъм"
    },
    "l7": {
        "title": "Урок 7",
        "text": "където ще научиш връзката между бисквитите и паметта"
    },
    "t1": {
        "title": "Тест 1",
        "text": "където ще провериш уменията си с компютри"
    },
    "l8": {
        "title": "Урок 8",
        "text": "където ще научиш какво ще учиш"
    },
    "l9": {
        "title": "Урок 9",
        "text": "където ще видиш код за първи път"
    },
    "l10": {
        "title": "Урок 10",
        "text": "където ще научиш какво е реално число"
    },
    "l11": {
        "title": "Урок 11",
        "text": "където ще научиш как се събират и изваждат числа… още веднъж"
    },
    "l12": {
        "title": "Урок 12",
        "text": "където ще разбереш защо учи кодирания на символи"
    },
    "l13": {
        "title": "Урок 13",
        "text": "където ще научиш как се запазва текст"
    },
    "l14": {
        "title": "Урок 14",
        "text": "където ще научиш общото между библиотеките и компютрите"
    },
    "l15": {
        "title": "Урок 15",
        "text": "където ще научиш как се ползва конзолата… от другата страна"
    },
    "t2": {
        "title": "Тест 2",
        "text": "където ще провериш способността си да запазваш информация"
    },
    "l16": {
        "title": "Урок 16",
        "text": "където ще научиш как се сравнява"
    },
    "l17": {
        "title": "Урок 17",
        "text": "където ще научиш как се сравнява…  няколко пъти на веднъж"
    },
    "l18": {
        "title": "Урок 18",
        "text": "където ще научиш как се контролира програма"
    },
    "l19": {
        "title": "Урок 19",
        "text": "където ще научиш как да пишеш проверки"
    },
    "t3": {
        "title": "Тест 3",
        "text": "където ще провериш способността си да контролираш кода"
    },
    "l20": {
        "title": "Урок 20",
        "text": "където ще научиш как програмите не се затварят веднага"
    },
    "l21": {
        "title": "Урок 21",
        "text": "където ще научиш как се брои"
    },
    "t4": {
        "title": "Тест 4",
        "text": "където ще провериш способността си да повтаряш"
    },
    "l22": {
        "title": "Урок 22",
        "text": "където ще научиш как да работиш с много информация"
    },
    "l23": {
        "title": "Урок 23",
        "text": "където ще разбереш връзката между последните уроци"
    },
    "l24": {
        "title": "Урок 24",
        "text": "където ще научиш как да сортираш… и как да не го правиш"
    },
    "l25": {
        "title": "Урок 25",
        "text": "където ще научиш че измеренията са повече от едно"
    },
    "t5": {
        "title": "Тест 5",
        "text": "където ще провериш способността си да работиш с много информация"
    },
    "l26": {
        "title": "Урок 26",
        "text": "където ще научиш как да организираш програмата си"
    },
    "l27": {
        "title": "Урок 27",
        "text": "където ще научиш как да не се повтаряш"
    },
    "l28": {
        "title": "Урок 28",
        "text": "където ще научиш че методите са навсякъде"
    },
    "t6": {
        "title": "Тест 6",
        "text": "където ще провериш колко си организиран"
    },
    "l29": {
        "title": "Урок 29",
        "text": "където ще научиш защо името е софтуерно инженерство"
    },
    "l30": {
        "title": "Урок 30",
        "text": "където ще научиш кaк да контролираш достъпа"
    },
    "l31": {
        "title": "Урок 31",
        "text": "където ще научиш, че има и непроменливи"
    },
    "l32": {
        "title": "Урок 32",
        "text": "където ще научиш какво е наследството"
    },
    "l33": {
        "title": "Урок 33",
        "text": "където ще научиш, че интерфейсите не са само графични"
    },
    "l34": {
        "title": "Урок 34",
        "text": "където ще се научиш да запазваш, без да знаеш какво"
    },
    "l35": {
        "title": "Урок 35",
        "text": "където ще научиш как да не използваш магия"
    },
    "t7": {
        "title": "Тест 7",
        "text": "където ще провериш знанията си за софтуерната архитектура"
    },
    "l36": {
        "title": "Урок 36",
        "text": "където ще научиш как да си оправяш грешките"
    },
    "l37": {
        "title": "Урок 37",
        "text": "където ще научиш как да правиш няколко неща едновременно"
    },
    "l38": {
        "title": "Урок 38",
        "text": "където ще научиш как да направиш живота си по-лесен... или поне кода"
    },
    "l39": {
        "title": "Урок 39",
        "text": "където ще научиш как да пътуваш назад във времето"
    },
    "l40": {
        "title": "Урок 40",
        "text": "където ще научиш как да използваш Интернет"
    },
    "l41": {
        "title": "Урок 41",
        "text": "където ще научиш опциите си"
    },
    "t8": {
        "title": "Тест 8",
        "text": "където ще се тестваш сам"
    },
    "l42": {
        "title": "Урок 42",
        "text": "където ще те изпратя"
    }
}